---
kind: method
id: M:Autodesk.Revit.DB.IFC.IFCProductWrapper.GetAllObjects
source: html/a9c471bf-4ff5-e805-15bd-faead58d766a.htm
---
# Autodesk.Revit.DB.IFC.IFCProductWrapper.GetAllObjects Method

Gets all objects associated with the IfcProduct in this wrapper.

## Syntax (C#)
```csharp
public ICollection<IFCAnyHandle> GetAllObjects()
```

## Returns
The collection of objects.